In [1]:
#pip install pandas
#%pip install mysql-connector-python
import mysql.connector as conn

In [2]:
import pandas as pd
act='actor.csv'
df_act=pd.read_csv(act)

In [3]:
#Para cada archivo primero hare un anaisis de nulos y vere que se puede limpiar.
#Tambien por otro lado vere los tipos de columnas para mi base de datos
df_act.isna().sum()

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

In [5]:
df_act.reset_index(drop=True)

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
196       197      REESE          WEST  2006-02-15 04:34:33
197       198       MARY        KEITEL  2006-02-15 04:34:33
198       199      JULIA       FAWCETT  2006-02-15 04:34:33
199       200      THORA        TEMPLE  2006-02-15 04:34:33
200       201     unknow        unknow  2006-02-15 04:46:27

[201 rows x 4 columns]

In [6]:
cate='category.csv'
df_cat=pd.read_csv(cate)

In [7]:
#df_cat.loc[len(df_cat)] = [ 17,'unknow', '2006-02-15 04:46:27']

In [8]:
df_cat.shape
df_cat.reset_index(drop=True)

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27
16           17       unknow  2006-02-15 04:46:27

In [9]:
film='film.csv'
df_film=pd.read_csv(film)

In [10]:
df_film.isna().sum(),df_film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

(film_id                    0
 title                      0
 description                0
 release_year               0
 language_id                0
 original_language_id    1000
 rental_duration            0
 rental_rate                0
 length                     0
 replacement_cost           0
 rating                     0
 special_features           0
 last_update                0
 dtype: int64,
 None)

In [11]:
df_film.shape

(1000, 13)

In [12]:
df_film.original_language_id

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
995   NaN
996   NaN
997   NaN
998   NaN
999   NaN
Name: original_language_id, Length: 1000, dtype: float64

In [13]:
#En mi df para mi cliente no le sirve esta columna, ya que el nno se dedica a vender pelis en idioma original
df_film.drop(columns='original_language_id',inplace=True)

In [14]:
df_film

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [15]:
invent='inventory.csv'
df_invent=pd.read_csv(invent)

In [16]:
df_invent.shape

(1000, 4)

In [17]:
df_invent.isna().sum()

inventory_id    0
film_id         0
store_id        0
last_update     0
dtype: int64

In [18]:
df_invent.head(10)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17
5             6        1         2  2006-02-15 05:09:17
6             7        1         2  2006-02-15 05:09:17
7             8        1         2  2006-02-15 05:09:17
8             9        2         2  2006-02-15 05:09:17
9            10        2         2  2006-02-15 05:09:17

In [19]:
#confirmo que mis datos son todos numericos, como true es 1 y false 0, se confirma que 1000, son numeros.
df_invent.dtypes
df_invent.store_id.apply(lambda x: True if x!=str else False).sum()

1000

In [20]:
df_invent.film_id.apply(lambda x: True if x!=str else False).sum()

1000

In [21]:
lang='language.csv'
df_lang=pd.read_csv(lang)

In [22]:
df_lang.isna().sum()

language_id    0
name           0
last_update    0
dtype: int64

In [23]:
df_lang.dtypes

language_id     int64
name           object
last_update    object
dtype: object

In [24]:
df_lang.shape,df_lang

((6, 3),
    language_id      name          last_update
 0            1   English  2006-02-15 05:02:19
 1            2   Italian  2006-02-15 05:02:19
 2            3  Japanese  2006-02-15 05:02:19
 3            4  Mandarin  2006-02-15 05:02:19
 4            5    French  2006-02-15 05:02:19
 5            6    German  2006-02-15 05:02:19)

In [25]:
HDD='old_HDD.csv'
df_HDD=pd.read_csv(HDD)

In [26]:
df_HDD.isna().sum()

first_name      0
last_name       0
title           0
release_year    0
category_id     0
dtype: int64

In [27]:
df_HDD.dtypes,df_HDD.shape

(first_name      object
 last_name       object
 title           object
 release_year     int64
 category_id      int64
 dtype: object,
 (1000, 5))

In [28]:
#quiero confirmar de que año son mis peliculas, y a la vez quiero saber si todas son del mismo año. El resultado es que todas son del mismo año
df_HDD.release_year.apply(lambda x: True if x >2005 and x<2007 else False).sum()

1000

In [29]:
df_HDD

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [30]:
rent='rental.csv'
df_rent=pd.read_csv(rent)

In [31]:
df_rent.isna().sum()

rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     0
dtype: int64

In [32]:
df_rent.dtypes,df_rent.shape

(rental_id        int64
 rental_date     object
 inventory_id     int64
 customer_id      int64
 return_date     object
 staff_id         int64
 last_update     object
 dtype: object,
 (1000, 7))

In [33]:
#hago un df mas claro dejando todos los numeros fuera, ya que las fechas no me proporcionaban mucha info y dificultaba la lectura. Y para que mi cliente no se vuelva loco con tantas columnas.
df_boni=df_rent.drop(columns=['rental_date','return_date','last_update'])
df_boni

     rental_id  inventory_id  customer_id  staff_id
0            1           367          130         1
1            2          1525          459         1
2            3          1711          408         1
3            4          2452          333         2
4            5          2079          222         1
..         ...           ...          ...       ...
995        997          4243          216         2
996        998          3395          389         1
997        999          4433          413         2
998       1000          1774          332         2
999       1001          1498           64         2

[1000 rows x 4 columns]

In [34]:
#Preparo una lectura de columnas para poder visualisar cual seria la manera mas coherente de poder realizar mi databse.
df_act.columns,df_cat.columns,df_film.columns,df_HDD.columns,df_invent.columns,df_lang.columns,df_rent.columns

(Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object'),
 Index(['category_id', 'name', 'last_update'], dtype='object'),
 Index(['film_id', 'title', 'description', 'release_year', 'language_id',
        'rental_duration', 'rental_rate', 'length', 'replacement_cost',
        'rating', 'special_features', 'last_update'],
       dtype='object'),
 Index(['first_name', 'last_name', 'title', 'release_year', 'category_id'], dtype='object'),
 Index(['inventory_id', 'film_id', 'store_id', 'last_update'], dtype='object'),
 Index(['language_id', 'name', 'last_update'], dtype='object'),
 Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
        'return_date', 'staff_id', 'last_update'],
       dtype='object'))

In [35]:
df_act.drop(columns='last_update',inplace=True)
df_cat.drop(columns='last_update',inplace=True)
df_film.drop(columns='last_update',inplace=True)
df_lang.drop(columns='last_update',inplace=True)
df_invent.drop(columns='last_update',inplace=True)

In [36]:
tengo=list(df_invent.film_id.unique())
pelis=[ x for x in df_film.film_id if x in tengo]

In [37]:
#creo un codigo que hace la misma funcioin con un merge, creando tablas intermedia para ordenar los datos.
#se me habia olvidado que existia el merge

pu=df_act['pru']=df_act['first_name']+' '+df_act['last_name']
dic={}
count=0
for i in pu:
    count+=1
    dic[i]=count
dic
df_act.drop(columns='pru',inplace=True)

In [38]:
#COLSULTA SOBRE IDS
pa=df_HDD['col']=df_HDD['first_name']+' '+df_HDD['last_name']
perr=pd.DataFrame({'actor_id':[dic[i] for i in pa]})
df_HDD.drop(columns='col',inplace=True)
ids=df_HDD.join(perr)
ids=ids.merge(df_film[['film_id','title']],on=(['title']),how='left')
ids.drop(columns='release_year',inplace=True)

In [39]:
#me planteo nombres duplicados, y hay uno, pero me acuerdo que mi cliente me dijo que eran unas gemelas.Y decido dejarlos con los mismos datos.
pu=df_act['pru']=df_act['first_name']+' '+df_act['last_name']
pu[pu.duplicated()==True]
df_act[df_act['pru']=='SUSAN DAVIS']

     actor_id first_name last_name          pru
100       101      SUSAN     DAVIS  SUSAN DAVIS
109       110      SUSAN     DAVIS  SUSAN DAVIS

In [40]:
df_act.drop(columns='pru',inplace=True)
df_invent
#dato que me parece curioso es que en la tabla de invent de todos 1000 titulos que tiene, dispone de 223.
df_invent.film_id.unique().shape
#la realidad es que solo son 207
num=list(df_invent.film_id.unique())

In [41]:
df_invent.groupby('film_id').agg({'inventory_id':'count'}).sum()
#compruebo que el total de peliculas por lo menos cumples los requisitos minimos de 1000 en stock

inventory_id    1000
dtype: int64

In [42]:
#investigo un poco sobres los titulos que me ha proporcionado en base su inventario
df_film[['film_id','title','replacement_cost']][df_film.film_id.apply(lambda x : True if x in num else False)==True].head(15)

    film_id             title  replacement_cost
0         1  ACADEMY DINOSAUR             20.99
1         2    ACE GOLDFINGER             12.99
2         3  ADAPTATION HOLES             18.99
3         4  AFFAIR PREJUDICE             26.99
4         5       AFRICAN EGG             22.99
5         6      AGENT TRUMAN             17.99
6         7   AIRPLANE SIERRA             28.99
7         8   AIRPORT POLLOCK             15.99
8         9     ALABAMA DEVIL             21.99
9        10  ALADDIN CALENDAR             24.99
10       11   ALAMO VIDEOTAPE             16.99
11       12    ALASKA PHANTOM             22.99
12       13       ALI FOREVER             21.99
14       15      ALIEN CENTER             10.99
15       16   ALLEY EVOLUTION             23.99

In [43]:
df_film[['film_id','title','replacement_cost']][df_film.film_id.apply(lambda x : True if x in num else False)==False].head(15)

     film_id                 title  replacement_cost
13        14        ALICE FANTASIA             23.99
32        33           APOLLO TEEN             15.99
35        36        ARGONAUTS TOWN             12.99
37        38         ARK RIDGEMONT             25.99
40        41  ARSENIC INDEPENDENCE             17.99
86        87     BOONDOCK BALLROOM             14.99
107      108         BUTCH PANTHER             19.99
127      128         CATCH AMISTAD             10.99
143      144   CHINATOWN GLADIATOR             24.99
147      148        CHOCOLATE DUCK             13.99
170      171  COMMANDMENTS EXPRESS             13.99
191      192      CROSSING DIVORCE             19.99
194      195       CROWDS TELEMARK             16.99
197      198      CRYSTAL BREAKING             22.99
216      217            DAZED PUNK             20.99

In [44]:
#parece que no solo le falta una quinta parte de sus titulos sino que tambien algunos de los iniciales.
df_invent.groupby('film_id').agg({'inventory_id':'count'}).mean()
medi_p=df_invent.groupby('film_id').agg({'inventory_id':'count'}).mean()
#la media de peliculas por titulo es de 4.83
#obsevando en la renta
df_rent['inventory_id'].max()
#mientras en renta hay un maximo de 4581 pelis que llego a tener en el inventario
#teniendo en cuenta que el tenia una cantidad de 1000 titulos
#y con un simple calculo, se ve que el producto por titulos que antes tenia es muy cercano a los que pudo rentar.
medi_p*df_film['film_id'].count()
#obtengo un valor bastante cercano a la pelicula rentada con mayor id "4830", esto sabiendo que las id del inventario son unicas hasta para un mismo producto
#Pero como sabemos no existe 4/5 de pelicula, redondeo y el minimo quedaria asi
int(medi_p)*df_film['film_id'].count()
round(medi_p)*df_film['film_id'].count()
#tengo valores entre 4000 y 5000 entre ambos se puede aproximar un poco para tener un valor mar certero
# en el caso uno"4000" hay una brecha de 580.
#en el caso dos "5000" hay otra brecha de 420.
#en cualquier caso ahora mi renta me cuadra con la informacion que me han proporcionado.
#solo quedaria saber que ha pasado con esos titulos que no me ha pasado.
df_rent

C:\Users\sebas\AppData\Local\Temp\ipykernel_25532\1583144377.py:13: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  int(medi_p)*df_film['film_id'].count()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [45]:
#por otra parte el año de lansamiento de las pelis es del 2006 cuando estos productos ya estaban guardados y inventariado en el 2005
#borro ese dato de mi archivo de film
#sera algun tipo ded pirateria?
df_film.drop(columns='release_year',inplace=True)
df_film

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes
...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,1,6,0.99,183,9.99,G,"Trailers,Behind the Scenes"
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,1,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes"
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,1,6,0.99,105,10.99,NC-17,Deleted Scenes
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,1,5,2.99,101,28.99,R,"Trailers,Deleted Scenes"
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,1,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes"

In [46]:
pelis_dis=df_film[['film_id','title','replacement_cost','rental_rate']][df_film.film_id.apply(lambda x : True if x in num else False)==True]
pelis_NoDis=df_film[['film_id','title','replacement_cost','rental_rate']][df_film.film_id.apply(lambda x : True if x in num else False)==False]

In [47]:
#intento entender porque se ha quedado con esas peliculas 
mean1=pelis_dis[['replacement_cost','rental_rate']].mean()
mean2=pelis_NoDis[['replacement_cost','rental_rate']].mean()
mean1,mean2

(replacement_cost    20.463430
 rental_rate          3.125266
 dtype: float64,
 replacement_cost    19.858852
 rental_rate          2.942081
 dtype: float64)

In [48]:
#para no dar muchas vueltas usare el calcula de la desviacion estandar
pelis_dis[['replacement_cost','rental_rate']].std(),pelis_NoDis[['replacement_cost','rental_rate']].std()

(replacement_cost    5.75790
 rental_rate         1.61938
 dtype: float64,
 replacement_cost    6.122318
 rental_rate         1.652278
 dtype: float64)

In [49]:
#solo veo que ha cogido un pequeño estraccto el cual le da un beneficio minio en cuanto a la variedad de informacion.
#ahora que ya he ordenado todos mi df. Paso a guardarlo en una base de datos
#df_act,df_cat,df_film,df_invent,df_lang,df_HDD,df_rent

In [50]:
conexion = conn.connect(host='127.0.0.1',                      #nombre del server
                        user='root',                           #nombre del usuario
                        passwd='Sebitas18Da')                  #contraseña del server
cursor = conexion.cursor()

In [51]:
cursor.execute('drop database if exists FilmShop;')
cursor.execute('create database FilmShop;')

In [52]:
cursor.execute('show databases;')
for e in cursor:
    print(e)

('filmshop',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [53]:
db=conn.connect(host='127.0.0.1',
                user='root',
                passwd='Sebitas18Da',
                database='FilmShop')
cursor=db.cursor()

In [54]:
df_act.columns

Index(['actor_id', 'first_name', 'last_name'], dtype='object')

In [55]:
def insertor(df,table):
    nombre_table2=table
    nombre_columns2=','.join(df.columns)
    for e in range(len(df)):
        valores=tuple(df.iloc[e].values)
        insert_query = f'insert into {nombre_table2} ({nombre_columns2}) values {valores}'
        cursor.execute(insert_query)

In [56]:
cursor.execute('drop table if exists act;')
query='''
create table act (
actor_id int primary key not null,
first_name varchar(40), 
last_name varchar(40))'''
cursor.execute(query)

In [57]:
insertor(df_act,'act')

In [58]:
df_cat.columns

Index(['category_id', 'name'], dtype='object')

In [59]:
cursor.execute('drop table if exists cat')
query='''
create table cat(
category_id int primary key not null,
name varchar(40))'''
cursor.execute(query)
insertor(df_cat,'cat')

In [60]:
df_lang.columns

Index(['language_id', 'name'], dtype='object')

In [61]:
cursor.execute('drop table if exists lang')
query='''
create table lang(
language_id int primary key not null,
name varchar(40))'''
cursor.execute(query)
insertor(df_lang,'lang')

In [62]:
df_film.columns

Index(['film_id', 'title', 'description', 'language_id', 'rental_duration',
       'rental_rate', 'length', 'replacement_cost', 'rating',
       'special_features'],
      dtype='object')

In [63]:
cursor.execute('drop table if exists film')
query='''
create table film(
film_id int primary key not null, 
title varchar(40), 
description varchar(200), 
language_id int, 
rental_duration int,
rental_rate float, 
length int, 
replacement_cost float, 
rating varchar(40),
special_features varchar(100),
foreign key (language_id) references lang(language_id))'''
cursor.execute(query)
insertor(df_film,'film')

In [64]:
cursor.execute('select * from film limit 2;')

for x in cursor:
    print(x)

(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 1, 6, 0.99, 86, 20.99, 'PG', 'Deleted Scenes,Behind the Scenes')
(2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 1, 3, 4.99, 48, 12.99, 'G', 'Trailers,Deleted Scenes')

In [65]:
df_invent.columns

Index(['inventory_id', 'film_id', 'store_id'], dtype='object')

In [104]:
# me doy cuenta que con este dato puedo relacionar las peliculas con los actores, para mi tabla intermedia y las id esten en su correcta posicion
id_act=ids['actor_id']
df_act[df_act['actor_id'].apply(lambda x : x in list(id_act))==True] #de los 200 actores solo conozco en que peliculas han trabajado 38
df_film[df_film['title'].apply(lambda x : x in list(ids['title']))==True]# de los 1000 titulos solo conozco 614 en los que actores han trabajado 
# en este puntp mi cliente deberia decidir que hacer con los demas nombres los cuales no tienen ninguna produccionn y aunque queden 400, al no tener una relacion clara, deberia ser desechado.
#como desconozco si tiene los demas archivos, los mantengo para en un futuro rellenarlo como es debido, mientras hare que sea funcional con lo que tiene
#voy ha crear una base de datos donde recoja toda esta informacion y me relacione con las peliculas que han hecho
df_invent['film_id'][df_invent['film_id'].apply(lambda x : x not in list(ids_uni['film_id']))==True]
connector=pd.DataFrame(df_act[['actor_id']])
connector=connector.merge(ids[['film_id','actor_id']],on='actor_id',how='left')
connector.dropna(subset=['film_id'], inplace=True)
connector.film_id=connector.film_id.astype(int)
connector=connector.merge(ids[['film_id','category_id']],on='film_id',how='left')
connector.drop_duplicates(inplace=True)
connector['category_id']=connector['category_id'].fillna(16).astype(int)
connector[connector['film_id'].duplicated()==True]

      actor_id  film_id  category_id
149          4       23            2
152          4       25           13
161          4       87           16
178          4      635           13
194          4      832            8
...        ...      ...          ...
2059        38      793            1
2062        38      827            7
2065        38      839           14
2067        38      853            3
2076        39      203           14

[386 rows x 3 columns]

In [99]:
cursor.execute('drop table if exists connect')
query='''
create table connect(
category_id int,
actor_id int,
film_id int,
foreign key (category_id) references cat(category_id),
foreign key (actor_id) references act(actor_id),
foreign key (film_id) references film(film_id))'''
cursor.execute(query)
insertor(connector,'connect')

In [98]:
cursor.execute('DROP TABLE IF EXISTS invent')

In [100]:
cursor.execute('DROP TABLE IF EXISTS invent')
query = '''
CREATE TABLE invent (
inventory_id INT PRIMARY KEY NOT NULL,
film_id INT,
store_id INT,
FOREIGN KEY (film_id) REFERENCES connect (film_id))'''
cursor.execute(query)
insertor(df_invent,'invent')

IntegrityError: 1452 (23000): Cannot add or update a child row: a foreign key constraint fails (`filmshop`.`invent`, CONSTRAINT `invent_ibfk_1` FOREIGN KEY (`film_id`) REFERENCES `connect` (`film_id`))